{
    "header.home": "Home",
    "header.aboutUs": "About Us",
    "header.events": "Events",
    "header.gallery": "Gallery",
    "header.experience": "Experience",
    "header.contactUs": "Contact Us",

    "slider.hello": "Hello, we are",
    "slider.name": "DJs Taki and Kibo",
    "slider.designation": "1000+ parties",
    "slider.description": "Welcome to the world of sound with DJs Taki and Kibo! Our passion for music has transcended boundaries, bringing you unforgettable moments with rhythms from various genres. Immerse yourself in our musical journey and experience the energy that will lift you to a new level. With a blend of talent and experience, we create magical moments for your ears. With us, every event becomes a memorable experience. Sounds that connect hearts - welcome to the world of DJs Taki and Kibo!",
    "slider.text1": "1000+ parties",
    "slider.text2": "Unparalleled atmosphere",
    "slider.text3": "A musical experience that will delight you",
    "slider.text4": "The latest hits and favorite classics in our performance",
    "slider.text5": "An experience to remember - join us on a unique journey through sound and rhythm",

    "about.biography": "Biography",
    
    "about.text1": "DJs Taki and Kibo are a dynamic duo who together create an unforgettable experience of musical ecstasy.",
    "about.text2": "We are passionate music enthusiasts with rich experience in the art of creating unique moments through sound and rhythm.",
    "about.text3": "DJ 'Taki', with his innovative approach to music, has a long and successful career.",
    "about.text4": "He has always been fascinated by the diversity of sound.",
    "about.text5": "His musical journey began as a young talent, and today he is known for his ability to create the perfect blend of traditional and modern, leaving the audience breathless at every performance.",
    "about.text6": "On the other hand, Kibo, a true musical marvel, possesses a unique sense of rhythm and harmony.",
    "about.text7": "His musical taste spans all genres, from electronic dance music to classic rock.",
    "about.text8": "Kibo is a master at intertwining different musical elements, creating an unforgettable experience for every listener.",
    "about.text9": "As a duo, DJs Taki and Kibo have created an authentic signature sound that permeates various musical genres.",
    "about.text10": "Their collaboration brings a unique blend of energy and emotion to every performance.",
    "about.text11": "With over a thousand parties behind them, these two DJs have become synonymous with top-notch entertainment and an unforgettable musical journey.",
    "about.text12": "Our passion for music knows no bounds; the mission is simple - connecting people through sound.",
    "about.text13": "We are not just DJs but also curators of unforgettable moments and experiences through music.",
    
    "about.djs": "DJs",
    "about.TakiKibo": "Taki & Kibo",
    
    "about.whatWeDo": "What We Do?",

    "music.trance": "Trance",
    "music.tranceDescription": "Trance music is characterized by its hypnotic melodies and repetitive beats, creating an immersive and euphoric experience.",
    "music.house": "House",
    "music.houseDescription": "House music is known for its steady 4/4 beat and repetitive rhythms, often featuring soulful vocals and electronic elements.",
    "music.deepHouse": "Deep House",
    "music.deepHouseDescription": "Deep House is a subgenre of house music known for its soulful and atmospheric sound, characterized by slow tempos and melodic basslines.",
    "music.electro": "Electro",
    "music.electroDescription": "Electro music features heavy use of synthesizers and drum machines, creating a futuristic and energetic sound with a focus on electronic elements.",
    "music.folk": "Folk",
    "music.folkDescription": "Folk music represents the traditional and cultural sounds of a specific region, often featuring acoustic instruments and storytelling lyrics.",
    "music.90s": "90s",
    "music.90sDescription": "90s music reflects the diverse musical styles of the 1990s, ranging from grunge and alternative rock to pop and hip-hop, defining a dynamic era in music history.",
    "music.techno": "Techno",
    "music.technoDescription": "Techno music is characterized by its repetitive beats, synthetic sounds, and futuristic atmosphere, creating an energetic and danceable experience.",
    "music.exYu": "Ex-Yugoslavia",
    "music.exYuDescription": "Ex-Yugoslavia music encompasses the diverse musical heritage of the former Yugoslav countries, blending various folk traditions with modern influences.",
    "music.2000s": "2000s",
    "music.2000sDescription": "2000s music captures the eclectic mix of genres and styles that emerged in the early 21st century, including pop, rock, hip-hop, and electronic music."
,
    "experience.experience": "Experience",
    "experience.educationSkills": "Education & Skills",

    "experience.jobPosition1": "Software Engineer",
    "experience.jobType1": "Internship | Hybrid",
    "experience.jobDuration1": "May 2023",
    "experience.timeDuration1": "Full Time",
    "experience.jobDescription1": "During the internship, I worked with technologies used within Levi9 Technology Services. The task was to create two WebAPIs and services for data synchronization between API services. The team I was part of implemented an authorized WebAPI in the C# programming language (.Net Core WebAPI), along with unit tests (NUnit, Moq), and integration tests.\n\nThe goal of this task was to familiarize myself with the implementation process from the initial request to the final solution. I used Swashbuckle, Swagger, and Postman tools for testing during the implementation. The API was developed following REST API guidelines, and MS SQL Express database was used for data storage, with the schema modeled using Entity Framework.\n\nAfter successfully implementing the API services, I worked on developing a React web application to showcase the functionalities of the implemented backend. Throughout the task, I utilized GIT as a version control system, using branching for each individual task.\n\nThe internship was conducted in a team of 6 students, where we had to collaborate and coordinate the implementation and task allocation.",
    
    "experience.jobPosition2": "Angular Web Developer",
    "experience.jobType2": "Freelance",
    "experience.jobDuration2": "Sep 2022 - Dec 2022",
    "experience.timeDuration2": "Part Time",    
    "experience.jobDescription2": "I worked independently as a freelance Angular Web Developer during this period, specifically on the project \"Auto School Tovariski.\" The project involved developing a website for the driving school using the Angular framework, aiming to provide comprehensive information and enhance user experience for potential students.\n\nIn this project, I leveraged my expertise in Angular, along with HTML, CSS, and JavaScript, to create a visually appealing and dynamic website. The website included sections such as \"About Us,\" where visitors could learn about the driving school's history and values, and \"Categories,\" showcasing the different driving courses available. Additionally, the \"Gallery\" section featured images of vehicles, students, and the premises. The \"Steps for Passing\" section explained the process of passing the driving exam, while the \"Frequently Asked Questions\" section provided answers to common inquiries. The \"Contact\" section allowed visitors to get in touch with the driving school.\n\nThroughout the development process, I focused on optimizing the website's performance, ensuring responsiveness across various devices, and creating an intuitive user interface using Angular's powerful features. I implemented components, services, and routing to create a seamless browsing experience. I also integrated relevant content and imagery to enhance the overall user experience.\n\nWorking on the Auto School Tovariski project allowed me to showcase my proficiency as an Angular Web Developer, demonstrating my ability to utilize Angular's capabilities to build dynamic and engaging web applications. I successfully delivered the project within the specified timeframe, meeting the client's requirements and contributing to the overall success of the driving school's online presence.\n\nPlease note that the provided information is based on the details you provided about your work on the Auto School Tovariski website as a freelance Angular Web Developer. Feel free to adjust the content as needed to accurately reflect your experience and contributions.",

    "experience.passingYear1": "2017-2023",
    "experience.degreeTitle1": "Faculty of Technical Sciences, University of Novi Sad",
    "experience.instituteName1": "Power Software Engineering",
    "experience.passingYear2": "2013-2017",
    "experience.degreeTitle2": "Technical school, Mihajlo Pupin, Inđija",
    "experience.instituteName2": "Computer technician",


    "skill.name1": "C#",
    "skill.name2": ".NET Framework",
    "skill.name3": "ASP.NET MVC",
    "skill.name4": "ASP.NET Web API",
    "skill.name5": "Angular",
    "skill.name6": "React",
    "skill.name7": "HTML",
    "skill.name8": "CSS",
    "skill.name9": "Swashbuckle Swagger",
    "skill.name10": "Postman",
    "skill.name11": "Familiarity with version control systems (Git, TFVC)",
    "skill.name12": "Testing and Quality Assurance (NUnit, Moq, integration tests)",
    "skill.name13": "JavaScript",
    "skill.name14": "Databases",
    "skill.name15": "C/C++",
    "skill.name16": "Python",

    "portfolio.name": "Gallery",
    "portfolio.tabList1": "Party 1",
    "portfolio.tabList2": "Party 2",
    "portfolio.tabList3": "Party 3",
    "portfolio.tabList4": "Party 4",
    "portfolio.tabList5": "Party 5",
    "portfolio.tabList6": "Party 6",

    "portfolio.img1": "/pictures/background.jpg",
    "portfolio.img2": "/pictures/DJTaki.png",
    "portfolio.img3": "/pictures/DJKibo.png",
    "portfolio.img4": "/pictures/DJTaki.jpg",
    "portfolio.img5": "/pictures/DJKibo.jpg",
    "portfolio.img6": "/pictures/DJTaki.png",
    "portfolio.img7": "/pictures/DJKibo.png",
    "portfolio.img8": "/pictures/DJTaki.png",
    "portfolio.img9": "/pictures/DJKibo.png",


   


    "portfolio.title1": "Titl 1",
    "portfolio.title2": "Titl 2",
    "portfolio.title3": "Titl 3",
    "portfolio.title4": "Titl 4",
    "portfolio.title5": "Titl 5",
    "portfolio.title6": "Titl 6",
    "portfolio.title7": "Titl 7",    
    "portfolio.title8": "Titl 8",
    "portfolio.title9": "Titl 9",

    "portfolio.subTitle1": "Subtitle 1",
    "portfolio.subTitle2": "Subtitle 2",
    "portfolio.subTitle3": "Subtitle 3",
    "portfolio.subTitle4": "Subtitle 4",
    "portfolio.subTitle5": "Subtitle 5",
    "portfolio.subTitle6": "Subtitle 6",
    "portfolio.subTitle7": "Subtitle 7",
    "portfolio.subTitle8": "Subtitle 8",
    "portfolio.subTitle9": "Subtitle 9",
   
    "portfolio.alternativetext1": "Alternative Text 1",
    "portfolio.alternativetext2": "Alternative Text 2",
    "portfolio.alternativetext3": "Alternative Text 3",
    "portfolio.alternativetext4": "Alternative Text 4",
    "portfolio.alternativetext5": "Alternative Text 5",
    "portfolio.alternativetext6": "Alternative Text 6",
    "portfolio.alternativetext7": "Alternative Text 7",
    "portfolio.alternativetext8": "Alternative Text 8",
    "portfolio.alternativetext9": "Alternative Text 9",
    
    "portfolio.link1": "Link 1",
    "portfolio.link2": "Link 2",
    "portfolio.link3": "Link 3",
    "portfolio.link4": "Link 4",
    "portfolio.link5": "Link 5",
    "portfolio.link6": "Link 6",
    "portfolio.link7": "Link 7",
    "portfolio.link8": "Link 8",
    "portfolio.link9": "Link 9",
    

    "contactme.name": "Contact us",
    "contact.toastSuccess": "Message sent successfully!",
    "contact.toastError": "An error occurred. Please try again later.",

    "contact.fullName": "Full name",
    "contact.emailAddress": "Your Email Address",
    "contract.subject":"Subject",
    "contact.typeComment": "Type a message",

    "contact.fullNameRequired": "Name is required",
    "contact.emailAddressRequired": "Email is Required",
    "contact.emailAddressRequiredMessage": "Entered value does not match email format",
    "contract.subjectRequired":"Subject is required.",
    "contact.typeCommentRequired": "Message is required.",
    
    "contact.sendMessageBtn": "Send Message",


    "contactinfo.h4": "What’s your story?",
    "contactinfo.p": "We are always available to throw the best party in town.\n\nFeel free to contact us.",
    "footer.developedBy": "Developed by"

}
  